Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
        if (_rxCount < _rxNaxCount) {
            _rxBuffer[_rxCount++] = _usart->RDR;
            if (_rxCount == _rxMaxCount) {
                ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
                notifyRxComplete(_rxBuffer, _rxCount, true);
                _state = State::ready;
            }
        }
    }

    // Interrupcio RX timeout
    //
    if ((_usart->CR1 & USART_CR1_RTOIE) && (_usart->ISR & USART_ISR_RTOF)) {

        _usart->ICR |= USART_ICR_RTOCF;
        ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
        notifyRxCompleted(_rxBuffer, _rxCount, true);
        _state = State::ready;
    }
}

#elif defined(EOS_PLATFORM_STM32G0)
void UARTDevice::interruptService() {

	auto CR1 = _usart->CR1;
	auto CR3 = _usart->CR3;
	auto ISR = _usart->ISR;

	// Comprova de forma rapida si hi ha errors
	//
	if (ISR & (USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE)) {

		// Comprova si es un error PARITY
		//
		if ((ISR & USART_ISR_PE) && (CR1 & USART_CR1_PEIE)) {

			// Borra el flag
			//
			_usart->ICR = USART_ICR_PECF;
		}

		// Comprova si hi ha error FRAME
		//
	    if ((ISR & USART_ISR_FE) && (CR3 & USART_CR3_EIE)) {

			// Borra el flag
			//
	    	_usart->ICR = USART_ICR_FECF;
	    }

	    // Comprova si es un error NOISE
	    //
	    if ((ISR & USART_ISR_NE) && (CR3 & USART_CR3_EIE)) {

			// Borra el flag
			//
	    	_usart->ICR = USART_ICR_NECF;
	    }

		// Comprova si es un error OVERRUN
		//
		if ((ISR & USART_ISR_ORE) &&
			(CR1 & USART_CR1_RXNEIE_RXFNEIE) &&
			(CR3 & (USART_CR3_RXFTIE | USART_CR3_EIE))) {

			// Borra el flag
			//
			_usart->ICR = USART_ICR_ORECF;
		}
	}

	// No hi han errrors
	//
	else {

		// Transmissio amb el FIFO activat
		//
		if (CR1 & USART_CR1_FIFOEN) {

		}

		// Transmissio amb el FIFO desactivat.
		///
		else {

			// Interrupcio 'TXE'
			//
			if ((CR1 & USART_CR1_TXEIE_TXFNFIE) && (ISR & USART_ISR_TXE_TXFNF)) {

				if (_txCount < _txMaxCount) {
					_usart->TDR = _txBuffer[_txCount++];
					if (_txCount == _txMaxCount) {

						ATOMIC_CLEAR_BIT(_usart->CR1,
							USART_CR1_TXEIE_TXFNFIE); // Deshabilita interrupcio TXE
						ATOMIC_SET_BIT(_usart->CR1,
							USART_CR1_TCIE);          // Habilita interrupcio TC
					}
				}
			}

			// Interrupcio 'TC'. Nomes en l'ultim caracter transmes.
			//
			if ((CR1 & USART_CR1_TCIE) && (CR1 & USART_CR1_TCIE)) {

				clearTransmissionCompleteFlag(_usart);
				disableTransmission(_usart);
				notifyTxCompleted(_txBuffer, _txCount, true);

				_state = State::ready;
			}

			/// Interrupcio 'RXNE'
			//
			if ((CR1 & USART_CR1_RXNEIE_RXFNEIE) && (ISR & USART_ISR_RXNE_RXFNE)) {
				if (_rxCount < _rxMaxCount) {
					_rxBuffer[_rxCount++] = _usart->RDR;
					if (_rxCount == _rxMaxCount) {

						disableReception(_usart);
						notifyRxCompleted(_rxBuffer, _rxCount, true);

						// Canvia l'estat
						//
						_state = State::ready;
					}
				}
			}

			// Interrupcio 'RTO'
			//
			if ((CR1 & USART_CR1_RTOIE) && (ISR & USART_ISR_RTOF)) {

				clearReceiverTimeOutFlag(_usart);
				disableReception(_usart);
				notifyRxCompleted(_rxBuffer, _rxCount, true);

				// Canvia d'estat
				//
				_state = State::ready;
			}
		}
	}
}
#endif


void UARTDevice::txInterruptService() {

}


void UARTDevice::rxInterruptService() {

}


/// ----------------------------------------------------------------------
/// \brief    Reb les notificacions del DMA
/// \param    devDMA: El dispositiu DMA que genera l'event.
/// \param    args: Parametres del event.
///
void UARTDevice::dmaNotifyEventHandler(
    DevDMA *devDMA,
    DMANotifyEventArgs &args) {

    switch (args.id) {

        // Transmissio complerta de tots els bytes.
        //
        case htl::dma::NotifyID::completed:
            _txCount = _txMaxCount;
            _usart->ICR = USART_ICR_TCCF;
            ATOMIC_SET_BIT(_usart->CR1, USART_CR1_TCIE);
            devDMA->disableNotifyEvent();
            break;

        // Error en la transmissio DMA.
        //
        case htl::dma::NotifyID::error:
            break;

        default:
        	break;
    }
}


/// ----------------------------------------------------------------------
/// \brief    Genera un event de notificacio 'TxComplete'
/// \param    buffer: El buffer de dades.
/// \param    length: El nombre de bytes de dades.
/// \param    irq: true si ve d'una interrupcio.
///
void UARTDevice::notifyTxCompleted(
	const uint8_t *buffer,
	unsigned length,
	bool irq) {

	NotifyEventArgs args = {
		.irq = irq,
		.txCompleted {
			.buffer = buffer,
			.length = length
		}
	};
	_erNotify.raise(NotifyID::txCompleted, &args);
}


/// ----------------------------------------------------------------------
/// \brief    Genera un event de notificacio 'RxComplete'
/// \param    buffer: El buffer de dades.
/// \param    length: El nombre de bytes de dades.
/// \param    irq: true si ve d'una interrupcio.
///
void UARTDevice::notifyRxCompleted(
	const uint8_t *buffer,
	unsigned length,
	bool irq) {

	NotifyEventArgs args = {
		.irq = irq,
		.rxCompleted {
			.buffer = buffer,
			.length = length
		}
	};
	_erNotify.raise(NotifyID::rxCompleted, &args);
}


/// ----------------------------------------------------------------------
/// \brief    Obte el rellotge asignat al generador de bauds.
/// \param    usart: El bloc de registres
/// \return   La opcio corresponent al rellotge.
///
static ClockSource getClockSource(
    USART_TypeDef *usart) {

    uint8_t sclk = 0;
    switch (reinterpret_cast<uint32_t>(usart)) {
        #ifdef HTL_UART1_EXIST
            case USART1_BASE:
                #if defined(EOS_PLATFORM_STM32G0) && defined(RCC_CCIPR_USART1SEL)
                sclk = (RCC->CCIPR & RCC_CCIPR_USART1SEL) >> RCC_CCIPR_USART1SEL_Pos;
                #elif defined(EOS_PLATFORM_STM32F0)
                sclk = (RCC->CFGR3 & RCC_CFGR3_USART1SW) >> RCC_CFGR3_USART1SW_Pos;
                #elif defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL) >> RCC_DCKCFGR2_USART1SEL_Pos;
                #endif
                break;
        #endif

        #ifdef HTL_UART2_EXIST
            case USART2_BASE:
                #if defined(EOS_PLATFORM_STM32G0) && defined(RCC_CCIPR_USART2SEL)
                sclk = (RCC->CCIPR & RCC_CCIPR_USART2SEL) >> RCC_CCIPR_USART2SEL_Pos;
                #elif defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL) >> RCC_DCKCFGR2_USART2SEL_Pos;
                #endif
                break;
        #endif

        #ifdef HTL_UART3_EXIST
            case USART3_BASE:
                #if defined(EOS_PLATFORM_STM32G0) && defined(RCC_CCIPR_USART3SEL)
                sclk = (RCC->CCIPR & RCC_CCIPR_USART3SEL) >> RCC_CCIPR_USART3SEL_Pos;
                #elif defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL) >> RCC_DCKCFGR2_USART3SEL_Pos;
                #endif
                break;
        #endif

        #ifdef HTL_UART4_EXIST
            case USART4_BASE:
                #if defined(EOS_PLATFORM_STM32G0)  && defined(RCC_CCIPR_USART4SEL)
                sclk = (RCC->CCIPR & RCC_CCIPR_USART4SEL) >> RCC_CCIPR_USART4SEL_Pos;
                #elif defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL) >> RCC_DCKCFGR2_UART4SEL_Pos;
                #endif
                break;
        #endif

        #ifdef HTL_UART5_EXIST
            case USART5_BASE:
                #if defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL) >> RCC_DCKCFGR2_UART5SEL_Pos;
                #endif
                break;
        #endif

        #ifdef HTL_UART6_EXIST
            case USART6_BASE:
                #if defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL) >> RCC_DCKCFGR2_USART6SEL_Pos;
                #endif
                break;
        #endif

        #ifdef HTL_UART7_EXIST
            case UART7_BASE:
                #if defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL) >> RCC_DCKCFGR2_UART7SEL_Pos;
                #endif
                break;
        #endif

        #ifdef HTL_UART8_EXIST
            case UART8_BASE:
                #if defined(EOS_PLATFORM_STM32F7)
                sclk = (RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL) >> RCC_DCKCFGR2_UART8SEL_Pos;
                #endif
                break;
        #endif
    }

#if defined(EOS_PLATFORM_STM32F0)
    static const ClockSource csTbl[4] = {
        ClockSource::pclk,
        ClockSource::sysclk,
        ClockSource::hsi,
        ClockSource::lse
    };
#elif defined(EOS_PLATFORM_STM32F4)
    static const ClockSource csTbl[4] = {
        ClockSource::pclk1,
        ClockSource::sysclk,
        ClockSource::hsi,
        ClockSource::lse
    };
#elif defined(EOS_PLATFORM_STM32F7)
    static const ClockSource csTbl[4] = {
        ClockSource::pclk,
        ClockSource::sysclk,
        ClockSource::hsi,
        ClockSource::lse
    };
#elif defined(EOS_PLATFORM_STM32G0)
    static const ClockSource csTbl[4] = {
        ClockSource::pclk,
        ClockSource::sysclk,
        ClockSource::hsi16,
        ClockSource::lse
    };
#else
    #error "Unknown platform"
#endif

    return csTbl[sclk];
}


