Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
	usart->CR1 |= USART_CR1_UE;

}


/// ----------------------------------------------------------------------
/// \brief    Desabilita el dispositiu.
/// \param    usart: Registres de hardware del dispositiu.
///
static void disable(
	USART_TypeDef *usart) {

	usart->CR1 &= ~(
		#if defined(EOS_PLATFORM_STM32G0)
		USART_CR1_FIFOEN | // Deshabilita el FIFO
		#endif
		USART_CR1_UE |     // Desabilita el dispositiu
		USART_CR1_TE |     // Desabilita la transmissio
		USART_CR1_RE);     // Deshabilita la recepcio
}


/// ----------------------------------------------------------------------
/// \brief    Deshabilita la transmissio
/// \param    usart: Registres de hardware del dispositiu.
///
static void disableTransmission(
	USART_TypeDef *usart) {

	auto a = startATOMIC();

	// Desabilita interrupcions i transmissio
	//
	usart->CR1 &= ~(
#if defined(EOS_PLATFORM_STM32F0)
		USART_CR1_TXEIE |         // Deshabilita interrupcio TXE
#else
		USART_CR1_TXEIE_TXFNFIE | // Deshabilita interrupcio TXE
#endif
		USART_CR1_TCIE |          // Deshabilita interrupcio TC
		USART_CR1_TE);            // Desabilita transmissio

	// Deshabilita el DMA
	//
	usart->CR3 &= ~USART_CR3_DMAT;

	endATOMIC(a);
}


/// ----------------------------------------------------------------------
/// \brief    Desabilita la recepcio.
/// \param    usart: Registres de hardware del dispositiu.
///
static void disableReception(
	USART_TypeDef *usart) {

	auto a = startATOMIC();

	// Desabilita interrupcions i recepcio
	//
	usart->CR1 &= ~(
#if defined(EOS_PLATFORM_STM32F0)
		USART_CR1_RXNEIE |         // Deshabilita interrupcio RXNE
#else
		USART_CR1_RXNEIE_RXFNEIE | // Deshabilita interrupcio RXNE
#endif
		USART_CR1_RTOIE |          // Deshabilita interrupcio RTO
		USART_CR1_PEIE |           // Deshabilita interrupcio PE
		USART_CR1_RE);             // Deshabilita recepcio

	// Deshabilita el DMA
	//
	usart->CR3 &= ~USART_CR3_DMAT;

	endATOMIC(a);
}
